README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-19 Tue 16:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Boyang Yan" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbfc34eb">1. Each colom represent mean</a>
<ul>
<li><a href="#orgcb2f955">1.1. note</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
-<b>- mode: org -</b>-
</p>
<div id="orgbfc34eb" class="outline-2">
<h2 id="orgbfc34eb"><span class="section-number-2">1</span> Each colom represent mean</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Column</th>
<th scope="col" class="org-left">Mean</th>
<th scope="col" class="org-left">remark</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">F</td>
<td class="org-left">ranking</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">G</td>
<td class="org-left">Chinese origin data</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">H</td>
<td class="org-left">Google translated data</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">I</td>
<td class="org-left">Baidu Chinese sentiment analysis positive probability</td>
<td class="org-left">base on Chinese origin data</td>
</tr>

<tr>
<td class="org-left">J</td>
<td class="org-left">Baidu Chinese sentiment analysis confidence</td>
<td class="org-left">base on Chinese origin data</td>
</tr>

<tr>
<td class="org-left">K</td>
<td class="org-left">Baidu Chinese sentiment analysis Negative probability</td>
<td class="org-left">base on Chinese origin data</td>
</tr>

<tr>
<td class="org-left">L</td>
<td class="org-left">Baidu Chinese sentiment analysis the category</td>
<td class="org-left">base on Chinese origin data</td>
</tr>

<tr>
<td class="org-left">M</td>
<td class="org-left">Baidu English sentiment analysis positive probability</td>
<td class="org-left">base on Google translated data</td>
</tr>

<tr>
<td class="org-left">N</td>
<td class="org-left">Baidu English sentiment analysis confidence</td>
<td class="org-left">base on Google translated data</td>
</tr>

<tr>
<td class="org-left">O</td>
<td class="org-left">Baidu English sentiment analysis Negative probability</td>
<td class="org-left">base on Google translated data</td>
</tr>

<tr>
<td class="org-left">P</td>
<td class="org-left">Baidu English sentiment analysis the category</td>
<td class="org-left">base on Google translated data</td>
</tr>

<tr>
<td class="org-left">Q</td>
<td class="org-left">Google Chinese sentiment analysis score</td>
<td class="org-left">base on Chinese origin data</td>
</tr>

<tr>
<td class="org-left">R</td>
<td class="org-left">Google Chinese sentiment analysis manitude</td>
<td class="org-left">base on Chinese origin data</td>
</tr>

<tr>
<td class="org-left">S</td>
<td class="org-left">Google English sentiment analysis score</td>
<td class="org-left">base on Google translated data</td>
</tr>

<tr>
<td class="org-left">T</td>
<td class="org-left">Google English sentiment analysis manitude</td>
<td class="org-left">base on Google translated data</td>
</tr>

<tr>
<td class="org-left">U</td>
<td class="org-left">Yandex translated data</td>
<td class="org-left">base on Chinese origin data</td>
</tr>

<tr>
<td class="org-left">V</td>
<td class="org-left">Google English sentiment analysis score</td>
<td class="org-left">base on Yandex translated data</td>
</tr>

<tr>
<td class="org-left">W</td>
<td class="org-left">Google English sentiment analysis manitude</td>
<td class="org-left">base on Yandex translated data</td>
</tr>

<tr>
<td class="org-left">X</td>
<td class="org-left">Baidu translated data</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Y</td>
<td class="org-left">Google English sentiment analysis score</td>
<td class="org-left">base on Baidu translated data</td>
</tr>

<tr>
<td class="org-left">Z</td>
<td class="org-left">Google English sentiment analysis manitude</td>
<td class="org-left">base on Baidu translated data</td>
</tr>
</tbody>
</table>
</div>

<div id="orgcb2f955" class="outline-3">
<h3 id="orgcb2f955"><span class="section-number-3">1.1</span> note</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Baidu sentiment analysis Category Note
<ul class="org-ul">
<li>2 mean to belong to the positive category, 1 mean to belong to the neutral category, and 0 mean to belong to the Negative category</li>
</ul></li>
<li>Google sentiment analysis Note
<ul class="org-ul">
<li>The score of a document's sentiment indicates the overall emotion of a document. The magnitude of a document's sentiment indicates how much emotional content is present within the document, and this value is often proportional to the length of the document.</li>
<li>A document with a neutral score (around 0.0) may indicate a low-emotion document, or may indicate mixed emotions, with both high positive and negative values which cancel each out. Generally, you can use magnitude values to disambiguate these cases, as truly neutral documents will have a low magnitude value, while mixed documents will have higher magnitude values.</li>
<li>“Clearly positive” and “clearly negative” sentiment varies for different use cases and customers. You might find differing results for your specific scenario. We recommend that you define a threshold that works for you, and then adjust the threshold after testing and verifying the results. For example, you may define a threshold of any score over 0.25 as clearly positive, and then modify the score threshold to 0.15 after reviewing your data and results and finding that scores from 0.15-0.25 should be considered positive as well.</li>
</ul></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Sede</th>
<th scope="col" class="org-right">Max cites</th>
<th scope="col" class="org-right">H-index</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Chile</td>
<td class="org-right">257.72</td>
<td class="org-right">21.39</td>
</tr>

<tr>
<td class="org-left">Leeds</td>
<td class="org-right">165.77</td>
<td class="org-right">19.68</td>
</tr>

<tr>
<td class="org-left">Sao Paolo</td>
<td class="org-right">71.00</td>
<td class="org-right">11.50</td>
</tr>

<tr>
<td class="org-left">Stockholm</td>
<td class="org-right">134.19</td>
<td class="org-right">14.33</td>
</tr>

<tr>
<td class="org-left">Morelia</td>
<td class="org-right">257.56</td>
<td class="org-right">17.67</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-right">Distance</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">8/25/2010</td>
<td class="org-right">3.2</td>
</tr>

<tr>
<td class="org-left">8/29/2010</td>
<td class="org-right">3.0</td>
</tr>

<tr>
<td class="org-left">9/1/2010</td>
<td class="org-right">2.4</td>
</tr>

<tr>
<td class="org-left">9/2/2010</td>
<td class="org-right">2.5</td>
</tr>

<tr>
<td class="org-left">9/5/2010</td>
<td class="org-right">2.3</td>
</tr>

<tr>
<td class="org-left">9/3/2010</td>
<td class="org-right">2.0</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-gnuplot"><span style="color: #268bd2; font-weight: bold;">reset</span>

<span style="color: #268bd2; font-weight: bold;">set</span> <span style="color: #b58900;">title</span> <span style="color: #2aa198;">"Running Stats"</span>

<span style="color: #268bd2; font-weight: bold;">set</span> xlabel <span style="color: #2aa198;">"Date"</span>
<span style="color: #268bd2; font-weight: bold;">set</span> xtics rotate by -45

<span style="color: #268bd2; font-weight: bold;">set</span> yrange [<span style="color: #268bd2; font-weight: bold;">1:5</span>]
<span style="color: #268bd2; font-weight: bold;">set</span> ylabel <span style="color: #2aa198;">"Distance (mi)"</span>

<span style="color: #859900; font-weight: bold;">plot</span> data u 2:xticlabels(1) w lp <span style="color: #b58900;">lw</span> 2 <span style="color: #b58900;">notitle</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #268bd2;">#include</span> <span style="color: #2aa198;">&lt;iostream&gt;</span>
<span style="color: #859900; font-weight: bold;">using</span> <span style="color: #859900; font-weight: bold;">namespace</span> <span style="color: #268bd2; font-weight: bold;">std</span>;
<span style="color: #b58900;">int</span> <span style="color: #268bd2;">main</span>()
{
  cout &lt;&lt; <span style="color: #2aa198;">"hello word!!!"</span> &lt;&lt; endl;
  <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #6c71c4;">0</span>;
}

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Boyang Yan</p>
<p class="date">Created: 2017-12-19 Tue 16:26</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
